app/Controllers/EncuestaController.php

INSERT INTO `survey_responses` (`survey_id`, `name`, `email`, `answers`, `created_at`, `updated_at`) VALUES (4, 'Juan Pérez', 'juan@example.com', '[{\"pregunta\":\"\\u00bfEl predio es un bald\\u00edo o est\\u00e1 edificado?\",\"respuesta\":{\"nombre\":\"Pendiente\",\"statusID\":\"8\"},\"tipo\":\"multiple\"},{\"pregunta\":\"\\u00bfLa construcci\\u00f3n aparenta estar abandonada o habitada?\",\"respuesta\":{\"nombre\":\"Habitada\",\"statusID\":null},\"tipo\":\"multiple\"}]', '2025-06-26 12:23:50', '2025-06-26 12:23:50')
---

    // 5️⃣ Guardar las respuestas
    $surveyModel = new \App\Models\SurveyResponseModel();
    $surveyModel->insert([
        'survey_id' => $json['survey_id'] ?? 4,
        'name' => $json['nombre_usuario'] ?? 'Desconocido',
        'email' => $json['correo_usuario'] ?? 'no@correo.com',
        'answers' => json_encode($respuestas),
        'created_at' => date('Y-m-d H:i:s')
    ]);