app/Controllers/Incidencias.php

SELECT *
FROM `tbl_tickets`
WHERE `tbl_tickets`.`id` = '326'
SELECT *
FROM `tbl_usuarios`
WHERE `tbl_usuarios`.`id` = '1'
---
 public function actualizarEstado() {
    $json = $this->request->getJSON(true);

    if (!isset($json['idTarea'], $json['idStatus'], $json['idUsuario'])) {
        return $this->respond([
            'success' => false,
            'message' => 'Ocurrió el siguiente error: Datos incompletos'
        ], 400);
    }

    // Verificar si la tarea existe
    $tarea = $this->tickets->find($json['idTarea']);
    if (!$tarea) {
        return $this->respond([
            'success' => false,
            'message' => 'Ocurrió el siguiente error: Tarea no encontrada'
        ], 404);
    }

    // Verificar si el usuario existe
    $usuario = $this->usuarios->find($json['idUsuario']);