app/Controllers/Incidencias.php

    $estadoModel = new \App\Models\EstadosArticuloModel();
    $cambios = $json['cambiosDeStatus'];

    $actividad = $this->actividadesExtra->find($idTarea);
---
SELECT *
FROM `actividades_extra`
WHERE `actividades_extra`.`id` = 1

        }
    }

    $this->actividadesExtra->update($idTarea, [
        'articulosPorEntregar' => json_encode($articulos)
    ]);
---
UPDATE `actividades_extra` SET `articulosPorEntregar` = '[{\"id\":3,\"nombre\":\"Manual\",\"imagen\":null,\"status\":{\"id\":\"2\",\"nombre\":\"No recibi\\u00f3\",\"color\":\"#FF9800\"}}]'
WHERE `actividades_extra`.`id` IN (1)

  public function actualizarEstado()
{
    $json = $this->request->getJSON(true);

    if (!isset($json['idActividad'], $json['idStatus'], $json['idUsuario'])) {
        return $this->respond([
            'status' => false,
            'message' => 'Faltan datos requeridos: idActividad, idStatus o idUsuario'
        ], 400);
    }

    // Soporte para formato tipo "act2"
    if (preg_match('/^act(\d+)$/', $json['idActividad'], $matches)) {
        $idActividad = intval($matches[1]);
    } else if (is_numeric($json['idActividad'])) {
        $idActividad = intval($json['idActividad']);
    } else {
        return $this->respond([
            'status' => false,
            'message' => 'Formato inválido de idActividad. Usa número o actN.'
        ], 400);
    }

    // Verificar si existe la actividad
    $actividad = $this->actividadesExtra->find($idActividad);
---
SELECT *
FROM `actividades_extra`
WHERE `actividades_extra`.`id` = 1


    // Verificar si el estado existe en la tabla tbl_estados_tarea
    $estadoModel = new \App\Models\EstadosTareaModel();
    $estado = $estadoModel->find($json['idStatus']);
---
SELECT *
FROM `tbl_estados_tarea`
WHERE `tbl_estados_tarea`.`id` = 5

    }

    // Actualizar el estado
    $this->actividadesExtra->update($idActividad, [
        'status_id' => $json['idStatus']
    ]);
---
UPDATE `actividades_extra` SET `status_id` = 5
WHERE `actividades_extra`.`id` IN (1)