app/Controllers/Login.php

SELECT *
FROM `tbl_usuarios`
WHERE `correo` = 'fredy.sepa@gmail.com'
 LIMIT 1
SELECT *
FROM `tbl_estados_tarea`
SELECT *
FROM `tbl_rondas`
SELECT *
FROM `tbl_tickets`
WHERE `ronda_id` = 'ronda1'
---
    public function index()
{
    $json = (array) ($this->request->getJSON() ?? $this->request->getPost());

    $rules = [
        'correo' => 'required|valid_email',
        'contrasena' => 'required|min_length[6]'
    ];

    if (!$this->validate($rules)) {
        return $this->failValidationErrors($this->validator->getErrors());
    }

    $correo = $json['correo'];
    $contrasena = $json['contrasena'];

    $user = $this->usuarios->where('correo', $correo)->first();
    if ($user === null) return $this->failUnauthorized('Correo electrónico no registrado');

    $estadosTarea = $this->estadosTarea->findAll();
    $estadosMap = [];

    foreach ($estadosTarea as $estado) {
        $estadosMap[$estado['id']] = [
            'nombre' => $estado['nombre'],
            'color' => $estado['color'] ?? '#CCCCCC'
        ];
    }

    $rondasBD = $this->rondas->findAll();
    $articulosGenerales = $this->articulos->where('ticket_id', null)->findAll();

    $rondas = array_map(function ($ronda) use ($estadosMap, $articulosGenerales) {
        $actividades = [];
        $rondaIdStr = 'ronda' . $ronda['id'];

        $tickets = $this->tickets->where('ronda_id', $rondaIdStr)->findAll();

        foreach ($tickets as $ticket) {
            $estadoId = $ticket['estado_id'] ?? 1;
            $estado = $estadosMap[$estadoId] ?? ['nombre' => 'Pendiente', 'color' => '#2196F3'];

            $tipoTicketId = $ticket['tipo_ticket_id'] ?? null;
            $tipo = $this->tipos->find($tipoTicketId);
            $nombreTipo = strtolower($tipo['nombre'] ?? 'reporte');

            $actividad = [
                'id' => 'act' . $ticket['id'],
                'ticket_id' => $ticket['id'],
                'ronda_id' => $rondaIdStr,
                'tipo' => ucfirst($nombreTipo),
                'status' => [
                    'id' => $estadoId,