app/Controllers/Login.php

SELECT *
FROM `tbl_usuarios`
WHERE `correo` = 'fredy.sepa@gmail.com'
 LIMIT 1
SELECT *
FROM `tbl_estados_tarea`
SELECT *
FROM `tbl_rondas`
SELECT *
FROM `articulos`
WHERE `ticket_id` IS NULL
SELECT *
FROM `surveys`
WHERE `surveys`.`id` = 4
SELECT *
FROM `tbl_tickets`
WHERE `ronda_id` = 'ronda1'
SELECT *
FROM `tipo_tickets`
WHERE `tipo_tickets`.`id` = '1'
---
     public function index()
{
    $json = (array) ($this->request->getJSON() ?? $this->request->getPost());

    $rules = [
        'correo' => 'required|valid_email',
        'contrasena' => 'required|min_length[6]'
    ];

    if (!$this->validate($rules)) {
        return $this->failValidationErrors($this->validator->getErrors());
    }

    $correo = $json['correo'];
    $contrasena = $json['contrasena'];

    $user = $this->usuarios->where('correo', $correo)->first();
    if ($user === null) return $this->failUnauthorized('Correo electrónico no registrado');

    $estadosTarea = $this->estadosTarea->findAll();
    $estadosMap = [];

    foreach ($estadosTarea as $estado) {
        $estadosMap[$estado['id']] = [
            'nombre' => $estado['nombre'],
            'color' => $estado['color'] ?? '#CCCCCC'
        ];
    }

    $rondasBD = $this->rondas->findAll();
    $articulosGenerales = $this->articulos->where('ticket_id', null)->findAll();
     // Cargar encuesta con ID 5
$encuesta = $this->survey->find(4);
$preguntasEncuesta = json_decode($encuesta['questions'], true);

    $rondas = array_map(function ($ronda) use ($estadosMap, $articulosGenerales, $user, $preguntasEncuesta) {

        $actividades = [];
        $rondaIdStr = 'ronda' . $ronda['id'];

        $tickets = $this->tickets->where('ronda_id', $rondaIdStr)->findAll();

        $fechasVencimiento = [];
$estadoColores = [
    'Baldio' => '#000000', // Negro
    'Abandonada' => '#808080', // Gris
    'Completada' => '#4CAF50', // Verde
    'Cancelada' => '#FF0000', // Rojo
    'No quiere interactuar' => '#FFA500', // Naranja
    'Volver' => '#FFFF00', // Amarillo
    'Contacto / Invitación' => '#2196F3', // Azul
    'Pendiente' => '#2196F3' // Azul por defecto
];

// Mapear nombre de estado a ID
$estadoNombreAId = array_flip([

SELECT `a`.`id`, `a`.`nombre`, `a`.`imagen`, `ta`.`estado_id`, `ta`.`unidades`
FROM `articulos` `a`
LEFT JOIN `ticket_articulo` `ta` ON `a`.`id` = `ta`.`articulo_id` AND `ta`.`ticket_id` = 336
SELECT *
FROM `estados_articulo`
---
  private function obtenerArticulosPorTicket($ticketId)
{
    $db = \Config\Database::connect();
    $builder = $db->table('articulos a');
    $builder->select('a.id, a.nombre, a.imagen, ta.estado_id, ta.unidades');
    $builder->join('ticket_articulo ta', 'a.id = ta.articulo_id AND ta.ticket_id = ' . $ticketId, 'left');
    $result = $builder->get()->getResultArray();

    // Obtener el mapeo de estados de artículos
    $estados = $this->estadosArticulo->findAll();