app/Controllers/Login.php

SELECT *
FROM `tbl_usuarios`
WHERE `tbl_usuarios`.`id` = '1'
---


        $operadorId = $ticket['usuario_id'] ?? null;
    $operador = $this->usuarios->find($operadorId);

SELECT `a`.`id`, `a`.`nombre`, `a`.`imagen`, `ta`.`estado_id`, `ta`.`unidades`
FROM `articulos` `a`
LEFT JOIN `ticket_articulo` `ta` ON `a`.`id` = `ta`.`articulo_id` AND `ta`.`ticket_id` = 336
SELECT *
FROM `estados_articulo`
---
  private function obtenerArticulosPorTicket($ticketId)
{
    $db = \Config\Database::connect();
    $builder = $db->table('articulos a');
    $builder->select('a.id, a.nombre, a.imagen, ta.estado_id, ta.unidades');
    $builder->join('ticket_articulo ta', 'a.id = ta.articulo_id AND ta.ticket_id = ' . $ticketId, 'left');
    $result = $builder->get()->getResultArray();

    // Obtener el mapeo de estados de artículos
    $estados = $this->estadosArticulo->findAll();