app/Controllers/RecuperarPassword.php

SELECT *
FROM `tbl_usuarios`
WHERE `correo` = 'javicellcartagena@gmail.com'
AND `cuenta_activada` = 1
 LIMIT 1
---
     public function enviarToken()
{
    $request = $this->request;

    // Detectar si es JSON
    if ($request->is('json')) {
        $data = $request->getJSON(true); // obtener array
        $correo = trim($data['correo'] ?? '');
    } else {
        $correo = trim($request->getPost('correo'));
    }

    if (empty($correo)) {
        return $this->response->setJSON([
            'status' => false,
            'message' => 'Debes ingresar tu correo electrónico.'
        ]);
    }

    $usuarioModel = new \App\Models\UsuariosModel();

    $usuario = $usuarioModel
        ->where('correo', $correo)
        ->where('cuenta_activada', 1)
        ->first();

UPDATE `tbl_usuarios` SET `reset_token` = '9f6b1d18fa89404c10ced2a697be26e735a11395988d63ba32a97488c360d83e', `token_expiry` = '2025-06-06 13:00:59', `fecha_actualizacion` = '2025-06-06 12:00:59'
WHERE `tbl_usuarios`.`id` IN ('154')
---
    $token = bin2hex(random_bytes(32));
    $fechaExpiracion = date('Y-m-d H:i:s', strtotime('+1 hour'));

    $usuarioModel->update($usuario['id'], [
        'reset_token' => $token,
        'token_expiry' => $fechaExpiracion
    ]);