app/Controllers/Reporte.php

     public function listarReporteCompleto()
{
    // Obtener datos combinados de la tabla categoria_subcategoria_prioridad con joins
    $data = $this->categoriaSubcategoriaPrioridad
        ->select('tbl_categoria_subcategoria_prioridad.*, tbl_categorias.id_categoria, tbl_categorias.nombre as categoria, tbl_subcategorias.id_subcategoria, tbl_subcategorias.nombre as subcategoria, tbl_prioridades.id_prioridad, tbl_prioridades.nombre as prioridad')
        ->join('tbl_categorias', 'tbl_categorias.id_categoria = tbl_categoria_subcategoria_prioridad.id_categoria')
        ->join('tbl_subcategorias', 'tbl_subcategorias.id_subcategoria = tbl_categoria_subcategoria_prioridad.id_subcategoria')
        ->join('tbl_prioridades', 'tbl_prioridades.id_prioridad = tbl_categoria_subcategoria_prioridad.id_prioridad')
        ->findAll();
---
SELECT `tbl_categoria_subcategoria_prioridad`.*, `tbl_categorias`.`id_categoria`, `tbl_categorias`.`nombre` as `categoria`, `tbl_subcategorias`.`id_subcategoria`, `tbl_subcategorias`.`nombre` as `subcategoria`, `tbl_prioridades`.`id_prioridad`, `tbl_prioridades`.`nombre` as `prioridad`
FROM `tbl_categoria_subcategoria_prioridad`
JOIN `tbl_categorias` ON `tbl_categorias`.`id_categoria` = `tbl_categoria_subcategoria_prioridad`.`id_categoria`
JOIN `tbl_subcategorias` ON `tbl_subcategorias`.`id_subcategoria` = `tbl_categoria_subcategoria_prioridad`.`id_subcategoria`
JOIN `tbl_prioridades` ON `tbl_prioridades`.`id_prioridad` = `tbl_categoria_subcategoria_prioridad`.`id_prioridad`

    unset($categoria);

    // Obtener estados de tarea desde la tabla
    $statusTarea = (new EstadosTareaModel())->findAll();
---
SELECT *
FROM `tbl_estados_tarea`

        }

        if ($video) {
            $uploadedFiles[] = $this->saveFile($video, 'video', $ticketId, $json['usuario_id']);
---
INSERT INTO `tbl_tickets` (`usuario_id`, `categoria_id`, `subcategoria_id`, `prioridad_id`, `descripcion`, `latitud`, `longitud`, `estado`, `fecha_creacion`, `cliente_id`, `area_id`, `campana_id`, `tipo_ticket_id`, `titulo`, `prioridad`, `identificador`, `direccion`, `nombreCiudadano`, `correoCiudadano`, `telefonoCiudadano`, `ronda_id`) VALUES ('1', '2', '2', '2', 'PASEO MISION DE JALPAN 11 INT 2 COLINAS DEL BOSQUE PRIMERA SECCION CORREGIDORA', '20.5300937762644', '-100.418969696734', 'Pendiente', '2025-07-02 09:49:57', '2', '1', '1', 2, 'Reporte: 686547155f836', '2', 'TKD-BE763A408A', 'PASEO MISION DE TILACO 40 INT 1 COLINAS DEL BOSQUE PRIMERA SECCION CORREGIDORA', 'Michel romero', 'reinaisabel@gmail.com', '31156543212', 'ronda3')